weidong-deng/LittleFS/Libraries/APM32F10x_StdPeriphDriver/src/apm32f10x_usb_device.c
        USBD_SOFCallback(usbdh);
    }
    
    /* Handle Expected Start of Frame */
    if(USBD_ReadIntFlag(usbdh->usbGlobal, USBD_INT_ESOF))
    {
        USBD_ClearIntFlag(usbdh->usbGlobal, USBD_INT_ESOF);
    }
}

#endif /* defined (USBD) */

#if defined (USB_OTG_FS)

/*!
 * @brief       Handle EP0 OUT SETUP transfer
 *
 * @param       usbdh: USB device handler.
 *
 * @param       dmaStatus: DMA status
 *
 * @param       setup: setup packet
 *
 * @retval      None
 */
void USBD_EP0_OutHandler(USBD_HANDLE_T* usbdh, uint8_t dmaStatus, uint8_t* setup)
{
//    uint32_t usbCoreID = *(__IO uint32_t*)(&usbdh->usbGlobal->GCID + 0x01);

    /* Configure EP0 */
    usbdh->usbDevice->EP_OUT[USBD_EP_0].DOEPTRS = 0;
    usbdh->usbDevice->EP_OUT[USBD_EP_0].DOEPTRS_B.EPPCNT = BIT_SET;
    usbdh->usbDevice->EP_OUT[USBD_EP_0].DOEPTRS_B.PID_SPCNT = 0x03;
    usbdh->usbDevice->EP_OUT[USBD_EP_0].DOEPTRS_B.EPTRS = 24;

    if (dmaStatus == ENABLE)
    {
        usbdh->usbDevice->EP_OUT[USBD_EP_0].DOEPDMA = (uint32_t)setup;

        /* Enable endpoint */
        usbdh->usbDevice->EP_OUT[USBD_EP_0].DOEPCTRL_B.USBAEP = BIT_SET;
        usbdh->usbDevice->EP_OUT[USBD_EP_0].DOEPCTRL_B.EPEN = BIT_SET;
    }
}

/*!
 * @brief       Handle EP OUT transfer complete interrupt
 *
 * @param       usbdh: USB device handler.
 *
 * @param       epNum: endpoint number
 *
 * @retval      None
 */
static void USBD_EP_OutXferHandler(USBD_HANDLE_T* usbdh, uint32_t epNum)
{
//    uint32_t usbCoreID = *(__IO uint32_t*)(&usbdh->usbGlobal->GCID + 0x01);
    uint8_t setupStatus = usbdh->usbDevice->EP_OUT[epNum].DOEPINT_B.SETPCMP;
    uint8_t rxOutDisStatus = usbdh->usbDevice->EP_OUT[epNum].DOEPINT_B.RXOTDIS;
    uint8_t xferSize = usbdh->usbDevice->EP_OUT[epNum].DOEPTRS_B.EPTRS;

    if (usbdh->usbCfg.dmaStatus == DISABLE)
    {
        /* Make sure is EP0 */
        if ((epNum == 0) && (usbdh->epOUT[epNum].bufLen == 0))
        {
            USBD_EP0_OutHandler(usbdh, DISABLE, (uint8_t*)usbdh->setup);
        }

        /* OUT data stage */
        USBD_DataOutStageCallback(usbdh, epNum);
    }
    else
    {
        /* SETUP stage is Done */
        if (setupStatus)
        {

        }
        else if (rxOutDisStatus)
        {
            usbdh->usbDevice->EP_OUT[epNum].DOEPINT_B.RXOTDIS = BIT_SET;
        }
        else if ((setupStatus | rxOutDisStatus) == 0)
        {
            /* receive OUT data packet on EP0 */
            usbdh->epOUT[epNum].bufCount = usbdh->epOUT[epNum].mps - xferSize;

            usbdh->epOUT[epNum].buffer += usbdh->epOUT[epNum].mps;

            /* Make sure is EP0 */
            if ((epNum == 0) && (usbdh->epOUT[epNum].bufLen == 0))
            {
                USBD_EP0_OutHandler(usbdh, ENABLE, (uint8_t*)usbdh->setup);
            }

            /* OUT data stage */
            USBD_DataOutStageCallback(usbdh, epNum);
        }
        else
        {

        }
    }
}

/*!
 * @brief       Handle EP OUT SETUP transfer interrupt
 *
 * @param       usbdh: USB device handler.
 *
 * @param       epNum: endpoint number
 *
 * @retval      None
 */
static void USBD_EP_OutSetupHandler(USBD_HANDLE_T* usbdh, uint32_t epNum)
{
    UNUSED(epNum);
    USBD_SetupStageCallback(usbdh);
}

/*!
 * @brief       Prepare empty TX FIFO
 *
 * @param       usbdh: USB device handler.
 *
 * @param       epNum: endpoint number
 *
 * @retval      None
 */
void USBD_EP_PushDataEmptyTxFifo(USBD_HANDLE_T* usbdh, uint8_t epNum)
{
    USB_OTG_ENDPOINT_INFO_T* ep;
    uint32_t lengthTemp;
    uint32_t length;

    ep = &usbdh->epIN[epNum];

    if (ep->bufCount > ep->bufLen)
    {
        return;
    }

    length = ep->bufLen - ep->bufCount;

    if (length > ep->mps)
    {
        length = ep->mps;
    }

    lengthTemp = (length + 3) / 4;

    while ((usbdh->usbDevice->EP_IN[epNum].DITXFSTS_B.INEPTXFSA >= lengthTemp) && \
            (ep->bufCount < ep->bufLen) && \
            (ep->bufLen != 0))
    {
        length = ep->bufLen - ep->bufCount;

        if (length > ep->mps)
        {
            length = ep->mps;
        }

        lengthTemp = (length + 3) / 4;

        USB_OTG_FIFO_WriteFifoPacket(usbdh->usbFifo, (uint8_t)epNum, ep->buffer, \
                                     (uint16_t)length, \
                                     usbdh->usbCfg.dmaStatus);

        ep->buffer      += length;
        ep->bufCount    += length;
    }

    if (ep->bufLen <= ep->bufCount)
    {
        USB_OTG_D_DisableInEpEmptyInterrupt(usbdh->usbDevice, epNum);
    }
}

/*!
 * @brief     USB device read EP last receive data size
 *
 * @param     usbdh: USB device handler.
 *
 * @param     epAddr: endpoint address
 *
 * @retval    size of last receive data
 */
uint32_t USBD_EP_ReadRxDataLen(USBD_HANDLE_T* usbdh, uint8_t epAddr)
{
    return usbdh->epOUT[epAddr & 0x0F].bufCount;
}

/*!
 * @brief     USB device EP start transfer
 *
 * @param     usbdh: USB device handler.
 *
 * @param     endpoint : endpoint handler
 *
 * @param     dmaStatus : DMA status
 *
 * @retval    None
 */
void USBD_EP_XferStart(USBD_HANDLE_T* usbdh, USB_OTG_ENDPOINT_INFO_T* endpoint, uint8_t dmaStatus)
{
    uint8_t epNum = endpoint->epNum;
    uint8_t epDir = endpoint->epDir;
    uint16_t epPacketCnt;

    if (epDir == EP_DIR_OUT)
    {
        usbdh->usbDevice->EP_OUT[epNum].DOEPTRS_B.EPPCNT = BIT_RESET;
        usbdh->usbDevice->EP_OUT[epNum].DOEPTRS_B.EPTRS = BIT_RESET;

        if (endpoint->bufLen)
        {
            epPacketCnt = (uint16_t)((endpoint->bufLen + endpoint->mps - 1) / (endpoint->mps));
            usbdh->usbDevice->EP_OUT[epNum].DOEPTRS_B.EPPCNT = epPacketCnt;
            usbdh->usbDevice->EP_OUT[epNum].DOEPTRS_B.EPTRS = endpoint->mps * epPacketCnt;
        }
        else
        {
            usbdh->usbDevice->EP_OUT[epNum].DOEPTRS_B.EPPCNT = 0x01;
            usbdh->usbDevice->EP_OUT[epNum].DOEPTRS_B.EPTRS = endpoint->mps;
        }

        if (dmaStatus == ENABLE)
        {
            if ((uint32_t)endpoint->buffer != 0)
            {
                usbdh->usbDevice->EP_OUT[epNum].DOEPDMA = (uint32_t)endpoint->buffer;
            }
        }

