weidong-deng/LittleFS/Libraries/APM32F10x_StdPeriphDriver/src/apm32f10x_usb_device.c
        if (endpoint->epType == EP_TYPE_ISO)
        {
            if (usbdh->usbDevice->DSTS_B.SOFNUM & 0x01)
            {
                usbdh->usbDevice->EP_OUT[epNum].DOEPCTRL_B.OFSET = BIT_SET;
            }
            else
            {
                usbdh->usbDevice->EP_OUT[epNum].DOEPCTRL_B.DPIDSET = BIT_SET;
            }
        }

        /* Enable endpoint */
        usbdh->usbDevice->EP_OUT[epNum].DOEPCTRL_B.NAKCLR = BIT_SET;
        usbdh->usbDevice->EP_OUT[epNum].DOEPCTRL_B.EPEN = BIT_SET;
    }
    else
    {
        /* Handle 0 length packet */
        if (endpoint->bufLen == 0)
        {
            usbdh->usbDevice->EP_IN[epNum].DIEPTRS_B.EPPCNT = BIT_RESET;
            usbdh->usbDevice->EP_IN[epNum].DIEPTRS_B.EPTRS = BIT_RESET;

            usbdh->usbDevice->EP_IN[epNum].DIEPTRS_B.EPPCNT = 0x01;
        }
        else
        {
            usbdh->usbDevice->EP_IN[epNum].DIEPTRS_B.EPPCNT = BIT_RESET;
            usbdh->usbDevice->EP_IN[epNum].DIEPTRS_B.EPTRS = BIT_RESET;

            epPacketCnt = (uint16_t)((endpoint->bufLen + endpoint->mps - 1) / (endpoint->mps));
            usbdh->usbDevice->EP_IN[epNum].DIEPTRS_B.EPPCNT = epPacketCnt;
            usbdh->usbDevice->EP_IN[epNum].DIEPTRS_B.EPTRS = endpoint->bufLen;

            if (endpoint->epType == EP_TYPE_ISO)
            {
                usbdh->usbDevice->EP_IN[epNum].DIEPTRS_B.TXDCNT = BIT_RESET;
                usbdh->usbDevice->EP_IN[epNum].DIEPTRS_B.TXDCNT = 0x01;
            }
        }

        if (dmaStatus == ENABLE)
        {
            if ((uint32_t)endpoint->dmaAddr != 0)
            {
                usbdh->usbDevice->EP_IN[epNum].DIEPDMA = (uint32_t)endpoint->dmaAddr;
            }

            if (endpoint->epType == EP_TYPE_ISO)
            {
                if (usbdh->usbDevice->DSTS_B.SOFNUM & 0x01)
                {
                    usbdh->usbDevice->EP_IN[epNum].DIEPCTRL_B.OFSET = BIT_SET;
                }
                else
                {
                    usbdh->usbDevice->EP_IN[epNum].DIEPCTRL_B.DPIDSET = BIT_SET;
                }
            }

            /* Enable endpoint */
            usbdh->usbDevice->EP_IN[epNum].DIEPCTRL_B.NAKCLR = BIT_SET;
            usbdh->usbDevice->EP_IN[epNum].DIEPCTRL_B.EPEN = BIT_SET;
        }
        else
        {
            /* Enable endpoint */
            usbdh->usbDevice->EP_IN[epNum].DIEPCTRL_B.NAKCLR = BIT_SET;
            usbdh->usbDevice->EP_IN[epNum].DIEPCTRL_B.EPEN = BIT_SET;

            if (endpoint->epType == EP_TYPE_ISO)
            {
                if (usbdh->usbDevice->DSTS_B.SOFNUM & 0x01)
                {
                    usbdh->usbDevice->EP_IN[epNum].DIEPCTRL_B.OFSET = BIT_SET;
                }
                else
                {
                    usbdh->usbDevice->EP_IN[epNum].DIEPCTRL_B.DPIDSET = BIT_SET;
                }

                USB_OTG_FIFO_WriteFifoPacket(usbdh->usbFifo, endpoint->epNum, \
                                             endpoint->buffer, endpoint->bufLen, \
                                             dmaStatus);
            }
            else
            {
                if (endpoint->bufLen)
                {
                    USB_OTG_D_EnableInEpEmptyInterrupt(usbdh->usbDevice, epNum);
                }
            }
        }
    }
}

/*!
 * @brief     USB device EP0 start transfer
 *
 * @param     usbdh: USB device handler.
 *
 * @param     endpoint : endpoint handler
 *
 * @param     dmaStatus : DMA status
 *
 * @retval    None
 */
void USBD_EP0_XferStart(USBD_HANDLE_T* usbdh, USB_OTG_ENDPOINT_INFO_T* endpoint, uint8_t dmaStatus)
{
    uint8_t epNum = endpoint->epNum;

    uint8_t epDir = endpoint->epDir;

    if (epDir == EP_DIR_OUT)
    {
        usbdh->usbDevice->EP_OUT[epNum].DOEPTRS_B.EPPCNT = BIT_RESET;
        usbdh->usbDevice->EP_OUT[epNum].DOEPTRS_B.EPTRS = BIT_RESET;

        if (endpoint->bufLen)
        {
            endpoint->bufLen = endpoint->mps;
        }

        usbdh->usbDevice->EP_OUT[epNum].DOEPTRS_B.EPPCNT = BIT_SET;
        usbdh->usbDevice->EP_OUT[epNum].DOEPTRS_B.EPTRS = endpoint->mps;

        if (dmaStatus == ENABLE)
        {
            if ((uint32_t)endpoint->buffer != 0)
            {
                usbdh->usbDevice->EP_OUT[epNum].DOEPDMA = (uint32_t)endpoint->buffer;
            }
        }

        /* Enable endpoint */
        usbdh->usbDevice->EP_OUT[epNum].DOEPCTRL_B.NAKCLR = BIT_SET;
        usbdh->usbDevice->EP_OUT[epNum].DOEPCTRL_B.EPEN = BIT_SET;
    }
    else
    {
        /* Handle 0 length packet */
        if (endpoint->bufLen == 0)
        {
            usbdh->usbDevice->EP_IN[epNum].DIEPTRS_B.EPPCNT = BIT_RESET;
            usbdh->usbDevice->EP_IN[epNum].DIEPTRS_B.EPTRS = BIT_RESET;

            usbdh->usbDevice->EP_IN[epNum].DIEPTRS_B.EPPCNT = 0x01;
        }
        else
        {
            usbdh->usbDevice->EP_IN[epNum].DIEPTRS_B.EPPCNT = BIT_RESET;
            usbdh->usbDevice->EP_IN[epNum].DIEPTRS_B.EPTRS = BIT_RESET;

            if (endpoint->bufLen > endpoint->mps)
            {
                endpoint->bufLen = endpoint->mps;
            }

            usbdh->usbDevice->EP_IN[epNum].DIEPTRS_B.EPPCNT = 0x01;
            usbdh->usbDevice->EP_IN[epNum].DIEPTRS_B.EPTRS = endpoint->bufLen;
        }

        if (dmaStatus == ENABLE)
        {
            if (endpoint->dmaAddr != 0)
            {
                usbdh->usbDevice->EP_IN[epNum].DIEPDMA = (uint32_t)(endpoint->dmaAddr);
            }

            /* Enable endpoint */
            usbdh->usbDevice->EP_IN[epNum].DIEPCTRL_B.NAKCLR = BIT_SET;
            usbdh->usbDevice->EP_IN[epNum].DIEPCTRL_B.EPEN = BIT_SET;
        }
        else
        {
            /* Enable endpoint */
            usbdh->usbDevice->EP_IN[epNum].DIEPCTRL_B.NAKCLR = BIT_SET;
            usbdh->usbDevice->EP_IN[epNum].DIEPCTRL_B.EPEN = BIT_SET;

            if (endpoint->bufLen)
            {
                USB_OTG_D_EnableInEpEmptyInterrupt(usbdh->usbDevice, epNum);
            }
        }
    }
}

/*!
 * @brief     USB device EP receive handler
 *
 * @param     usbdh: USB device handler.
 *
 * @param     epAddr : endpoint address
 *
 * @param     buffer : data buffer
 *
 * @param     length : length of data
 *
 * @retval    None
 */
void USBD_EP_Receive(USBD_HANDLE_T* usbdh, uint8_t epAddr, \
                     uint8_t* buffer, uint32_t length)
{
    uint8_t epAddrTemp = epAddr & 0x0F;

