weidong-deng/LittleFS/Libraries/APM32F10x_StdPeriphDriver/src/apm32f10x_usb_device.c
    usbdh->epOUT[epAddrTemp].epNum = epAddr & 0x0F;
    usbdh->epOUT[epAddrTemp].epDir = EP_DIR_OUT;

    usbdh->epOUT[epAddrTemp].buffer = buffer;
    usbdh->epOUT[epAddrTemp].bufCount = 0;
    usbdh->epOUT[epAddrTemp].bufLen = length;

    if (epAddr & 0x0F)
    {
        USBD_EP_XferStart(usbdh, &usbdh->epOUT[epAddrTemp], usbdh->usbCfg.dmaStatus);
    }
    else
    {
        USBD_EP0_XferStart(usbdh, &usbdh->epOUT[epAddrTemp], usbdh->usbCfg.dmaStatus);
    }
}

/*!
 * @brief     USB device EP transfer handler
 *
 * @param     usbdh: USB device handler.
 *
 * @param     epAddr : endpoint address
 *
 * @param     buffer : data buffer
 *
 * @param     length : length of data
 *
 * @retval    None
 */
void USBD_EP_Transfer(USBD_HANDLE_T* usbdh, uint8_t epAddr, \
                      uint8_t* buffer, uint32_t length)
{
    uint8_t epAddrTemp = epAddr & 0x0F;

    usbdh->epIN[epAddrTemp].epNum = epAddr & 0x0F;
    usbdh->epIN[epAddrTemp].epDir = EP_DIR_IN;

    usbdh->epIN[epAddrTemp].buffer = buffer;
    usbdh->epIN[epAddrTemp].bufCount = 0;
    usbdh->epIN[epAddrTemp].bufLen = length;

    if (epAddr & 0x0F)
    {
        USBD_EP_XferStart(usbdh, &usbdh->epIN[epAddrTemp], usbdh->usbCfg.dmaStatus);
    }
    else
    {
        USBD_EP0_XferStart(usbdh, &usbdh->epIN[epAddrTemp], usbdh->usbCfg.dmaStatus);
    }
}

/*!
 * @brief     USB device flush EP handler
 *
 * @param     usbdh: USB device handler.
 *
 * @param     epAddr : endpoint address
 *
 * @retval    usb device status
 */
void USBD_EP_Flush(USBD_HANDLE_T* usbdh, uint8_t epAddr)
{
    if (epAddr & 0x80)
    {
        USB_OTG_FlushTxFIFO(usbdh->usbGlobal, (uint8_t)(epAddr & 0x0F));
    }
    else
    {
        USB_OTG_FlushRxFIFO(usbdh->usbGlobal);
    }
}

/*!
 * @brief       Handle RxFIFO no empty interrupt
 *
 * @param       usbdh: USB device handler.
 *
 * @retval      None
 */
static void USBD_RxFifoNoEmptyIsrHandler(USBD_HANDLE_T* usbdh)
{
    USBD_FIFO_STA_T fifoStatus;
    uint8_t epNum;
    uint8_t packetStatus;
    uint16_t packetCnt;

    /* Disable RxFIFO no empty Interrup */
    USB_OTG_DisableGlobalInterrupt(usbdh->usbGlobal, USB_INT_G_RXFNONE);

    /* Read and pop the RxFIFO status data */
    fifoStatus.FIFO_STATUS = USB_OTG_PopRxFifoStatus(usbdh->usbGlobal);
    epNum = fifoStatus.FIFO_STATUS_B.epNum;
    packetStatus = fifoStatus.FIFO_STATUS_B.packetStatus;
    packetCnt = fifoStatus.FIFO_STATUS_B.byteCount;

    switch (packetStatus)
    {
        case USBD_PKTSTS_G_OUT_NAK:
            break;

        case USBD_PKTSTS_REV_DATA_OUT_PKT:
            /* Receive OUT data packet */
            if ((packetCnt != 0) && (usbdh->epOUT[epNum].buffer != NULL))
            {
                USB_OTG_FIFO_ReadRxFifoPacket(usbdh->usbFifo, \
                                              usbdh->epOUT[epNum].buffer, \
                                              packetCnt);

                usbdh->epOUT[epNum].buffer += packetCnt;
                usbdh->epOUT[epNum].bufCount += packetCnt;
            }
            break;

        case USBD_PKTSTS_OUT_DONE:
            break;

        case USBD_PKTSTS_SETUP_DONE:
            break;

        case USBD_PKTSTS_REV_SETUP_PKT:
            USB_OTG_FIFO_ReadRxFifoPacket(usbdh->usbFifo, \
                                          (uint8_t*)usbdh->setup, \
                                          8);

            usbdh->epOUT[epNum].bufCount += packetCnt;
            break;

        default:
            break;
    }

    /* Enable RxFIFO no empty Interrupt */
    USB_OTG_EnableGlobalInterrupt(usbdh->usbGlobal, USB_INT_G_RXFNONE);
}

/*!
 * @brief       Handle OUT endpiont interrupt
 *
 * @param       usbdh: USB device handler.
 *
 * @retval      None
 */
static void USBD_OutEndpointIsrHandler(USBD_HANDLE_T* usbdh)
{
    uint16_t epIntBits;
    uint8_t epNum;

    /* Read all device endpoint interrupt bit */
    epIntBits = USB_OTG_D_ReadAllOutEpIntNumber(usbdh->usbDevice);

    for (epNum = 0; epNum < 16; epNum++)
    {
        if (!(epIntBits >> epNum))
        {
            break;
        }
        /* Find out all the interrupt OUT endpoint */
        else if ((epIntBits >> epNum) & 0x01)
        {
            /* Transfer completed */
            if (USB_OTG_D_ReadOutEpIntStatus(usbdh->usbDevice, epNum, USBD_INT_EP_OUT_TSFCMP))
            {
                USB_OTG_D_ClearOutEpIntStatus(usbdh->usbDevice, epNum, USBD_INT_EP_OUT_TSFCMP);

                /* Handle OUT transfer EP */
                USBD_EP_OutXferHandler(usbdh, epNum);
            }

            /* Setup completed */
            if (USB_OTG_D_ReadOutEpIntStatus(usbdh->usbDevice, epNum, USBD_INT_EP_OUT_SETPCMP))
            {
                USB_OTG_D_ClearOutEpIntStatus(usbdh->usbDevice, epNum, USBD_INT_EP_OUT_SETPCMP);

                /* Handle SETUP transfer */
                USBD_EP_OutSetupHandler(usbdh, epNum);
            }

            /* OUT token received when endpoint disabled */
            if (USB_OTG_D_ReadOutEpIntStatus(usbdh->usbDevice, epNum, USBD_INT_EP_OUT_RXOTDIS))
            {
                USB_OTG_D_ClearOutEpIntStatus(usbdh->usbDevice, epNum, USBD_INT_EP_OUT_RXOTDIS);
            }

            /* Endpoint disable */
            if (USB_OTG_D_ReadOutEpIntStatus(usbdh->usbDevice, epNum, USBD_INT_EP_OUT_EPDIS))
            {
                USB_OTG_D_ClearOutEpIntStatus(usbdh->usbDevice, epNum, USBD_INT_EP_OUT_EPDIS);
            }

            /* Received Back-to-back SETUP packets over 3 */
            if (USB_OTG_D_ReadOutEpIntStatus(usbdh->usbDevice, epNum, USBD_INT_EP_OUT_RXBSP))
            {
                USB_OTG_D_ClearOutEpIntStatus(usbdh->usbDevice, epNum, USBD_INT_EP_OUT_RXBSP);
            }
        }
    }
}

/*!
 * @brief       Handle IN endpiont interrupt
 *
 * @param       usbdh: USB device handler.
 *
 * @retval      None
 */
static void USBD_InEndpointIsrHandler(USBD_HANDLE_T* usbdh)
{
    uint16_t epIntBits;
    uint8_t epNum;

    /* Read all device endpoint interrupt bit */
    epIntBits = USB_OTG_D_ReadAllInEpIntNumber(usbdh->usbDevice);

    for (epNum = 0; epNum < 16; epNum++)
    {
        if (!(epIntBits >> epNum))
        {
            break;
        }
        /* Find out all the interrupt IN endpoint */
        else if ((epIntBits >> epNum) & 0x01)
        {
            /* Transfer completed */
            if (USB_OTG_D_ReadInEpIntStatus(usbdh->usbDevice, epNum, USBD_INT_EP_IN_TSFCMP))
            {
                USB_OTG_D_DisableInEpEmptyInterrupt(usbdh->usbDevice, epNum & 0x0F);

                USB_OTG_D_ClearInEpIntStatus(usbdh->usbDevice, epNum, USBD_INT_EP_IN_TSFCMP);

                if (usbdh->usbCfg.dmaStatus == ENABLE)
                {
                    usbdh->epIN[epNum].buffer += usbdh->epIN[epNum].mps;

