weidong-deng/LittleFS/Libraries/APM32F10x_StdPeriphDriver/src/apm32f10x_usb_device.c
    /* Clear interrupt */
    USB_OTG_ClearGlobalIntFlag(usbdh->usbGlobal, USB_INT_G_ENUMD);
}

/*!
 * @brief       Handle USB Start of Frame interrupt
 *
 * @param       usbdh: USB device handler.
 *
 * @retval      None
 */
static void USBD_SofIsrHanlder(USBD_HANDLE_T* usbdh)
{
    USBD_SOFCallback(usbdh);

    /* Clear interrupt */
    USB_OTG_ClearGlobalIntFlag(usbdh->usbGlobal, USB_INT_G_SOF);
}

/*!
 * @brief       Handle USB incomplete ISO IN interrupt
 *
 * @param       usbdh: USB device handler.
 *
 * @retval      None
 */
static void USBD_IsoInInCompleteIsrHanlder(USBD_HANDLE_T* usbdh)
{
    uint8_t epNum = 0;

    USBD_IsoInInCompleteCallback(usbdh, epNum);

    /* Clear interrupt */
    USB_OTG_ClearGlobalIntFlag(usbdh->usbGlobal, USB_INT_G_IIINTX);
}

/*!
 * @brief       Handle USB incomplete ISO OUT interrupt
 *
 * @param       usbdh: USB device handler.
 *
 * @retval      None
 */
static void USBD_IsoOutInCompleteIsrHanlder(USBD_HANDLE_T* usbdh)
{
    uint8_t epNum = 0;

    USBD_IsoOutInCompleteCallback(usbdh, epNum);

    /* Clear interrupt */
    USB_OTG_ClearGlobalIntFlag(usbdh->usbGlobal, USB_INT_G_IP_OUTTX);
}

/*!
 * @brief       Handle USB New Session detected interrupt
 *
 * @param       usbdh: USB device handler.
 *
 * @retval      None
 */
static void USBD_NewSessionIsrHandler(USBD_HANDLE_T* usbdh)
{
    /* Connect callback */
    USBD_ConnectCallback(usbdh);

    /* Clear interrupt */
    USB_OTG_ClearGlobalIntFlag(usbdh->usbGlobal, USB_INT_G_SREQ);
}

/*!
 * @brief       Handle USB OTG interrupt
 *
 * @param       usbdh: USB device handler.
 *
 * @retval      None
 */
static void USBD_OTGIsrHandler(USBD_HANDLE_T* usbdh)
{
    /* Session end */
    if (usbdh->usbGlobal->GINT_B.SEFLG == BIT_SET)
    {
        /* Disconnect callback */
        USBD_DisconnectCallback(usbdh);

        usbdh->usbGlobal->GINT_B.SEFLG = BIT_SET;
    }
}

/*!
 * @brief     Handle USB device global interrupt
 *
 * @param     usbdh: USB device handler
 *
 * @retval    None
 */
void USBD_OTG_IsrHandler(USBD_HANDLE_T* usbdh)
{
    if (USB_OTG_ReadMode(usbdh->usbGlobal) == USB_OTG_MODE_DEVICE)
    {
        /* Avoid spurious interrupt */
        if (USB_OTG_ReadInterrupts(usbdh->usbGlobal) == 0U)
        {
            return;
        }

        /* Handle Mode Mismatch Interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbdh->usbGlobal, USB_INT_G_MMIS))
        {
            /* Clear interrupt */
            USB_OTG_ClearGlobalIntFlag(usbdh->usbGlobal, USB_INT_G_MMIS);
        }

        /* Handle RxFIFO no empty interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbdh->usbGlobal, USB_INT_G_RXFNONE))
        {
            USBD_RxFifoNoEmptyIsrHandler(usbdh);
        }

        /* Handle OUT Endpoint interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbdh->usbGlobal, USB_INT_G_ONEP))
        {
            USBD_OutEndpointIsrHandler(usbdh);
        }

        /* Handle IN Endpoint interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbdh->usbGlobal, USB_INT_G_INEP))
        {
            USBD_InEndpointIsrHandler(usbdh);
        }

        /* Handle USB Reset interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbdh->usbGlobal, USB_INT_G_USBRST))
        {
            USBD_ResetIsrHandler(usbdh);
        }

        /* Handle Resume/remote wakeup detected interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbdh->usbGlobal, USB_INT_G_RWAKE))
        {
            USBD_ResumeIsrHandler(usbdh);
        }

        /* Handle USB suspend interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbdh->usbGlobal, USB_INT_G_USBSUS))
        {
            USBD_SuspendIsrHandler(usbdh);
        }

        /* Handle Enumeration done interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbdh->usbGlobal, USB_INT_G_ENUMD))
        {
            USBD_EnumDoneIsrHandler(usbdh);
        }

        /* Handle SOF interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbdh->usbGlobal, USB_INT_G_SOF))
        {
            USBD_SofIsrHanlder(usbdh);
        }

        /* Handle Incomplete ISO IN interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbdh->usbGlobal, USB_INT_G_IIINTX))
        {
            USBD_IsoInInCompleteIsrHanlder(usbdh);
        }

        /* Handle Incomplete ISO OUT interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbdh->usbGlobal, USB_INT_G_IP_OUTTX))
        {
            USBD_IsoOutInCompleteIsrHanlder(usbdh);
        }

        /* Handle Session request/new session detected interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbdh->usbGlobal, USB_INT_G_SREQ))
        {
            USBD_NewSessionIsrHandler(usbdh);
        }

        /* Handle OTG interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbdh->usbGlobal, USB_INT_G_OTG))
        {
            USBD_OTGIsrHandler(usbdh);
        }
    }
}

/*!
 * @brief     Config Depth and start address of TxFifo
 *
 * @param     usbdh: USB device handler
 *
 * @param     epInNum : IN EP number
 *
 * @param     depth : depth of TxFIFO
 *
 * @retval    None
 */
void USBD_OTG_ConfigDeviceTxFifo(USBD_HANDLE_T* usbdh, uint8_t epInNum, uint16_t depth)
{
    uint32_t txFifoConfig = (((uint32_t)depth) << 16);
    uint32_t txOffset;
    uint8_t i;

    txOffset = usbdh->usbGlobal->GRXFIFO;

    if (epInNum)
    {
        txOffset += (usbdh->usbGlobal->GTXFCFG) >> 16;

        for (i = 0; i < epInNum - 1; i++)
        {
            txOffset += (usbdh->usbGlobal->DTXFIFO[i].word >> 16);
        }

        usbdh->usbGlobal->DTXFIFO[epInNum - 1].word = txFifoConfig | txOffset;
    }
    else
    {
        usbdh->usbGlobal->GTXFCFG = txFifoConfig | txOffset;
    }
}

/*!
 * @brief     Config the USB device peripheral according to the specified parameters
 *
 * @param     usbdh: USB device handler
 *
 * @retval    None
 */
void USBD_Config(USBD_HANDLE_T* usbdh)
{
    uint8_t i;

    /* FS PHY */
    USB_OTG_ConfigPHY(usbdh->usbGlobal, USB_OTG_PHY_SP_FS);

    /* Reset core */
    USB_OTG_CoreReset(usbdh->usbGlobal);
    USBD_UserDelayCallback(usbdh, 50);

    /* Activate the power down*/
    USB_OTG_DisablePowerDown(usbdh->usbGlobal);

    /* Device mode or host mode */
    USB_OTG_ConfigMode(usbdh->usbGlobal, usbdh->usbCfg.mode);

    /* Init control endpoint structure */
    for (i = 0; i < usbdh->usbCfg.devEndpointNum; i++)
    {
        /* OUT control endpoint */
        usbdh->epOUT[i].epNum       = i;
        usbdh->epOUT[i].epDir       = EP_DIR_OUT;

