weidong-deng/LittleFS/Libraries/APM32F10x_StdPeriphDriver/src/apm32f10x_usb_device.c
    if ((epAddr & 0x0F) > usbdh->usbCfg.devEndpointNum)
    {
        return;
    }

    if ((epAddr & 0x80) == 0x80)
    {
        ep = &usbdh->epIN[epAddr & 0x0F];
        ep->epDir = EP_DIR_IN;
    }
    else
    {
        ep = &usbdh->epOUT[epAddr & 0x0F];
        ep->epDir = EP_DIR_OUT;
    }

    ep->stallStatus = DISABLE;
    ep->epNum = epAddr & 0x0F;

    if (ep->epDir == EP_DIR_IN)
    {
        usbdh->usbDevice->EP_IN[ep->epNum].DIEPCTRL_B.STALLH = BIT_RESET;

        if ((ep->epType == EP_TYPE_BULK) || (ep->epType == EP_TYPE_INTERRUPT))
        {
            usbdh->usbDevice->EP_IN[ep->epNum].DIEPCTRL_B.DPIDSET = BIT_SET;
        }
    }
    else
    {
        usbdh->usbDevice->EP_OUT[ep->epNum].DOEPCTRL_B.STALLH = BIT_RESET;

        if ((ep->epType == EP_TYPE_BULK) || (ep->epType == EP_TYPE_INTERRUPT))
        {
            usbdh->usbDevice->EP_OUT[ep->epNum].DOEPCTRL_B.DPIDSET = BIT_SET;
        }
    }
}

/*!
 * @brief     USB device set device address
 *
 * @param     usbdh: USB device handler
 *
 * @param     address: address
 *
 * @retval    None
 */
void USBD_SetDevAddress(USBD_HANDLE_T* usbdh, uint8_t address)
{
    usbdh->address = address;

    USB_OTG_D_ConfigDeviceAddress(usbdh->usbDevice, address);
}

/*!
 * @brief     USB device set EP on stall status
 *
 * @param     usbdh: USB device handler
 *
 * @param     epAddr: endpoint address
 *
 * @retval    None
 */
void USBD_EP_Stall(USBD_HANDLE_T* usbdh, uint8_t epAddr)
{
    USB_OTG_ENDPOINT_INFO_T* ep;

    if ((epAddr & 0x0F) > usbdh->usbCfg.devEndpointNum)
    {
        return;
    }

    if ((epAddr & 0x80) == 0x80)
    {
        ep = &usbdh->epIN[epAddr & 0x0F];
        ep->epDir = EP_DIR_IN;
    }
    else
    {
        ep = &usbdh->epOUT[epAddr & 0x0F];
        ep->epDir = EP_DIR_OUT;
    }

    ep->stallStatus = ENABLE;
    ep->epNum = epAddr & 0x0F;

    if (ep->epDir == EP_DIR_IN)
    {
        if ((ep->epNum != 0) && \
                (usbdh->usbDevice->EP_IN[ep->epNum].DIEPCTRL_B.EPEN == 0))
        {
            usbdh->usbDevice->EP_IN[ep->epNum].DIEPCTRL_B.EPDIS = BIT_RESET;
        }

        usbdh->usbDevice->EP_IN[ep->epNum].DIEPCTRL_B.STALLH = BIT_SET;
    }
    else
    {
        if ((ep->epNum != 0) && \
                (usbdh->usbDevice->EP_OUT[ep->epNum].DOEPCTRL_B.EPEN == 0))
        {
            usbdh->usbDevice->EP_OUT[ep->epNum].DOEPCTRL_B.EPDIS = BIT_RESET;
        }

        usbdh->usbDevice->EP_OUT[ep->epNum].DOEPCTRL_B.STALLH = BIT_SET;
    }
    
    if((epAddr & 0x0F) == USBD_EP_0)
    {
        USBD_EP0_OutHandler(usbdh, usbdh->usbCfg.dmaStatus, (uint8_t *)usbdh->setup);
    }
}

/*!
 * @brief     USB device start
 *
 * @param     usbdh: USB device handler
 *
 * @retval    None
 */
void USBD_Start(USBD_HANDLE_T* usbdh)
{
    if ((usbdh->usbCfg.batteryStatus == ENABLE) && \
            (usbdh->usbCfg.phyType != USB_OTG_PHY_EX))
    {
        USB_OTG_DisablePowerDown(usbdh->usbGlobal);
    }

    /* Enable USB OTG all global interrupt */
    USB_OTG_EnableAllGlobalInterrupt(usbdh->usbGlobal);

    /* Reset PHY, gate and PHY CLK */
    usbdh->usbPower->PCGCTRL_B.PCLKSTOP = BIT_RESET;
    usbdh->usbPower->PCGCTRL_B.GCLK = BIT_RESET;

    /* Disable soft disconnect */
    USB_OTG_D_ConfigSoftDisconnect(usbdh->usbDevice, USBD_SOFT_DISC_NORMAL);
}

/*!
 * @brief     USB device stop
 *
 * @param     usbdh: USB device handler
 *
 * @retval    None
 */
void USBD_Stop(USBD_HANDLE_T* usbdh)
{
    /* Enable USB OTG all global interrupt */
    USB_OTG_DisableAllGlobalInterrupt(usbdh->usbGlobal);
    
    /* Reset PHY, gate and PHY CLK */
    usbdh->usbPower->PCGCTRL_B.PCLKSTOP = BIT_RESET;
    usbdh->usbPower->PCGCTRL_B.GCLK = BIT_RESET;
    
    /* Enable soft disconnect */
    USB_OTG_D_ConfigSoftDisconnect(usbdh->usbDevice, USBD_SOFT_DISC_ENABLE);
    
    USB_OTG_FlushTxFIFO(usbdh->usbGlobal, 0x10);
    
    if((usbdh->usbCfg.batteryStatus == ENABLE) && \
       (usbdh->usbCfg.phyType != USB_OTG_PHY_EX))
    {
        USB_OTG_EnablePowerDown(usbdh->usbGlobal);
    }
}

/*!
 * @brief     USB device stop
 *
 * @param     usbdh: USB device handler
 *
 * @retval    None
 */
void USBD_StopDevice(USBD_HANDLE_T* usbdh)
{
    uint8_t i;
    
    for(i = 0; i < 0x08; i++)
    {
        /* Clear endpoint Flag */
        usbdh->usbDevice->EP_OUT[i].DOEPINT &= 0xFB7F;
        /* Clear endpoint Flag */
        usbdh->usbDevice->EP_IN[i].DIEPINT &= 0xFB7F;
    }
    
    usbdh->usbDevice->DINIMASK = 0;
    usbdh->usbDevice->DOUTIMASK = 0;
    usbdh->usbDevice->DAEPIMASK = 0;
    
    USB_OTG_FlushRxFIFO(usbdh->usbGlobal);
    
    USB_OTG_FlushTxFIFO(usbdh->usbGlobal, 0x10);
}

#endif /* defined (USB_OTG_FS) */

/*!
 * @brief     USB device resume callback
 *
 * @param     usbdh: USB device handler
 *
 * @retval    None
 */
__weak void USBD_ResumeCallback(USBD_HANDLE_T* usbdh)
{
    UNUSED(usbdh);
    /* callback interface */
}

/*!
 * @brief     USB device suspend callback
 *
 * @param     usbdh: USB device handler
 *
 * @retval    None
 */
__weak void USBD_SuspendCallback(USBD_HANDLE_T* usbdh)
{
    UNUSED(usbdh);
    /* callback interface */
}

/*!
 * @brief     USB device enum done callback
 *
 * @param     usbdh: USB device handler
 *
 * @retval    None
 */
__weak void USBD_EnumDoneCallback(USBD_HANDLE_T* usbdh)
{
    UNUSED(usbdh);
    /* callback interface */
}

/*!
 * @brief     USB device SETUP stage callback
 *
 * @param     usbdh: USB device handler
 *
 * @retval    None
 */
__weak void USBD_SetupStageCallback(USBD_HANDLE_T* usbdh)
{
    UNUSED(usbdh);
    /* callback interface */
}

/*!
 * @brief     USB device data IN stage callback
 *
 * @param     usbdh: USB device handler
 *
 * @param     epNum: endpoint number
 *
 * @retval    None
 */
__weak void USBD_DataInStageCallback(USBD_HANDLE_T* usbdh, uint8_t epNum)
{
    UNUSED(usbdh);
    UNUSED(epNum);
    /* callback interface */
}

/*!
 * @brief     USB device data OUT stage callback
 *
 * @param     usbdh: USB device handler
 *
 * @param     epNum: endpoint number
 *
 * @retval    None
 */
__weak void USBD_DataOutStageCallback(USBD_HANDLE_T* usbdh, uint8_t epNum)
{
    UNUSED(usbdh);
    UNUSED(epNum);
    /* callback interface */
}

/*!
 * @brief       USB device SOF event callback function
 *
 * @param       usbhh: USB host handler.
 *
 * @retval      None
 */
__weak void USBD_SOFCallback(USBD_HANDLE_T* usbdh)
{
    UNUSED(usbdh);
    /* callback interface */
}

/*!
 * @brief     USB device ISO IN in complete callback
 *
 * @param     usbdh: USB device handler
 *
 * @param     epNum: endpoint number
 *
 * @retval    None
 */
__weak void USBD_IsoInInCompleteCallback(USBD_HANDLE_T* usbdh, uint8_t epNum)
{
    UNUSED(usbdh);
    UNUSED(epNum);
    /* callback interface */
}

/*!
 * @brief     USB device ISO OUT in complete callback
 *
 * @param     usbdh: USB device handler
 *
 * @param     epNum: endpoint number
 *
 * @retval    None
 */
__weak void USBD_IsoOutInCompleteCallback(USBD_HANDLE_T* usbdh, uint8_t epNum)
{
    UNUSED(usbdh);
    UNUSED(epNum);
    /* callback interface */
}

/*!
 * @brief     USB device connect callback
 *
 * @param     usbdh: USB device handler
 *
 * @retval    None
 */
__weak void USBD_ConnectCallback(USBD_HANDLE_T* usbdh)
{
    UNUSED(usbdh);
    /* callback interface */
}

/*!
 * @brief     USB device disconnect callback
 *
 * @param     usbdh: USB device handler
 *
 * @retval    None
 */
__weak void USBD_DisconnectCallback(USBD_HANDLE_T* usbdh)
{
    UNUSED(usbdh);
    /* callback interface */
}

/*!
 * @brief       USB device delay callback function
 *
 * @param       usbhh: USB host handler.
 *
 * @param       nms: number of milliseconds to delay
 *
 * @retval      None
 */
__weak void USBD_UserDelayCallback(USBD_HANDLE_T* usbdh, uint32_t nms)
{
    UNUSED(usbdh);
    UNUSED(nms);
    /* callback interface */
}

/**@} end of group USB_Device_Functions*/
/**@} end of group USB_Device_Driver*/

#endif /* USBD | USB_OTG_FS */

/**@} end of group APM32F10x_StdPeriphDriver*/
